{"class_name": "Functional", "config": {"name": "self2noise_model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00001", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00001", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00002", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00002", "inbound_nodes": [[["Layer_00001", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00003", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00003", "inbound_nodes": [[["Layer_00002", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00004", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00004", "inbound_nodes": [[["Layer_00003", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00005", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00005", "inbound_nodes": [[["Layer_00004", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00011", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00011", "inbound_nodes": [[["Layer_00004", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00017", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00017", "inbound_nodes": [[["Layer_00004", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00023", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00023", "inbound_nodes": [[["Layer_00004", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00007", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00007", "inbound_nodes": [[["Layer_00005", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00013", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00013", "inbound_nodes": [[["Layer_00011", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00019", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00019", "inbound_nodes": [[["Layer_00017", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00025", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00025", "inbound_nodes": [[["Layer_00023", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00006", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00006", "inbound_nodes": [[["Layer_00007", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00012", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00012", "inbound_nodes": [[["Layer_00013", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00018", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00018", "inbound_nodes": [[["Layer_00019", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00024", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00024", "inbound_nodes": [[["Layer_00025", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00008", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00008", "inbound_nodes": [[["Layer_00006", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00014", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00014", "inbound_nodes": [[["Layer_00012", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00020", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00020", "inbound_nodes": [[["Layer_00018", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00026", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00026", "inbound_nodes": [[["Layer_00024", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00010", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00010", "inbound_nodes": [[["Layer_00008", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00016", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00016", "inbound_nodes": [[["Layer_00014", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00022", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00022", "inbound_nodes": [[["Layer_00020", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00028", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00028", "inbound_nodes": [[["Layer_00026", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00009", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00009", "inbound_nodes": [[["Layer_00010", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00015", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00015", "inbound_nodes": [[["Layer_00016", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00021", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00021", "inbound_nodes": [[["Layer_00022", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00027", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00027", "inbound_nodes": [[["Layer_00028", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["Layer_00009", 0, 0, {}], ["Layer_00015", 0, 0, {}], ["Layer_00021", 0, 0, {}], ["Layer_00027", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00029", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00029", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00031", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00031", "inbound_nodes": [[["Layer_00029", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00030", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00030", "inbound_nodes": [[["Layer_00031", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00032", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00032", "inbound_nodes": [[["Layer_00030", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00034", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00034", "inbound_nodes": [[["Layer_00032", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00033", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00033", "inbound_nodes": [[["Layer_00034", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00035", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00035", "inbound_nodes": [[["Layer_00033", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00037", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00037", "inbound_nodes": [[["Layer_00035", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00036", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00036", "inbound_nodes": [[["Layer_00037", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00038", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00038", "inbound_nodes": [[["Layer_00036", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00040", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00040", "inbound_nodes": [[["Layer_00038", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00039", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00039", "inbound_nodes": [[["Layer_00040", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00041", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00041", "inbound_nodes": [[["Layer_00039", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00047", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00047", "inbound_nodes": [[["Layer_00039", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00043", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00043", "inbound_nodes": [[["Layer_00041", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00049", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00049", "inbound_nodes": [[["Layer_00047", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00042", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00042", "inbound_nodes": [[["Layer_00043", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00048", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00048", "inbound_nodes": [[["Layer_00049", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00044", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00044", "inbound_nodes": [[["Layer_00042", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00050", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00050", "inbound_nodes": [[["Layer_00048", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00046", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00046", "inbound_nodes": [[["Layer_00044", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00052", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00052", "inbound_nodes": [[["Layer_00050", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00045", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00045", "inbound_nodes": [[["Layer_00046", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00051", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00051", "inbound_nodes": [[["Layer_00052", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["Layer_00045", 0, 0, {}], ["Layer_00051", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00053", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00053", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00055", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00055", "inbound_nodes": [[["Layer_00053", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00054", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00054", "inbound_nodes": [[["Layer_00055", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00056", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00056", "inbound_nodes": [[["Layer_00054", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00058", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00058", "inbound_nodes": [[["Layer_00056", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00057", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00057", "inbound_nodes": [[["Layer_00058", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00059", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00059", "inbound_nodes": [[["Layer_00057", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00061", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00061", "inbound_nodes": [[["Layer_00059", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00060", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00060", "inbound_nodes": [[["Layer_00061", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00062", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00062", "inbound_nodes": [[["Layer_00060", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00064", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00064", "inbound_nodes": [[["Layer_00062", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00063", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00063", "inbound_nodes": [[["Layer_00064", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00065", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00065", "inbound_nodes": [[["Layer_00063", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00071", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00071", "inbound_nodes": [[["Layer_00063", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00067", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00067", "inbound_nodes": [[["Layer_00065", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00073", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00073", "inbound_nodes": [[["Layer_00071", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00066", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00066", "inbound_nodes": [[["Layer_00067", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00072", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00072", "inbound_nodes": [[["Layer_00073", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00068", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00068", "inbound_nodes": [[["Layer_00066", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00074", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00074", "inbound_nodes": [[["Layer_00072", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00070", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00070", "inbound_nodes": [[["Layer_00068", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00076", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00076", "inbound_nodes": [[["Layer_00074", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00069", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00069", "inbound_nodes": [[["Layer_00070", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00075", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00075", "inbound_nodes": [[["Layer_00076", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["Layer_00069", 0, 0, {}], ["Layer_00075", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00077", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00077", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00079", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00079", "inbound_nodes": [[["Layer_00077", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00078", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00078", "inbound_nodes": [[["Layer_00079", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00080", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00080", "inbound_nodes": [[["Layer_00078", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00082", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00082", "inbound_nodes": [[["Layer_00080", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00081", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00081", "inbound_nodes": [[["Layer_00082", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00083", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00083", "inbound_nodes": [[["Layer_00081", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00085", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00085", "inbound_nodes": [[["Layer_00083", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00084", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00084", "inbound_nodes": [[["Layer_00085", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00086", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00086", "inbound_nodes": [[["Layer_00084", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00088", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00088", "inbound_nodes": [[["Layer_00086", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00087", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00087", "inbound_nodes": [[["Layer_00088", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00089", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00089", "inbound_nodes": [[["Layer_00087", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00095", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00095", "inbound_nodes": [[["Layer_00087", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00091", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00091", "inbound_nodes": [[["Layer_00089", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00097", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00097", "inbound_nodes": [[["Layer_00095", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00090", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00090", "inbound_nodes": [[["Layer_00091", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00096", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00096", "inbound_nodes": [[["Layer_00097", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00092", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00092", "inbound_nodes": [[["Layer_00090", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00098", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00098", "inbound_nodes": [[["Layer_00096", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00094", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00094", "inbound_nodes": [[["Layer_00092", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00100", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00100", "inbound_nodes": [[["Layer_00098", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00093", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00093", "inbound_nodes": [[["Layer_00094", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00099", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00099", "inbound_nodes": [[["Layer_00100", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_3", "inbound_nodes": [[["Layer_00093", 0, 0, {}], ["Layer_00099", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00101", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00101", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00103", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00103", "inbound_nodes": [[["Layer_00101", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00102", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00102", "inbound_nodes": [[["Layer_00103", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00104", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00104", "inbound_nodes": [[["Layer_00102", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00106", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00106", "inbound_nodes": [[["Layer_00104", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00105", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00105", "inbound_nodes": [[["Layer_00106", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Layer_00107", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Layer_00107", "inbound_nodes": [[["Layer_00105", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "config": {"name": "Layer_00109", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_00109", "inbound_nodes": [[["Layer_00107", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "Layer_00108", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "Layer_00108", "inbound_nodes": [[["Layer_00109", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Layer_00110", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Layer_00110", "inbound_nodes": 